pmo-dataset/variations/graphviz_with_ids/06.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Successful delivery"];
  "Task_2" [label="Customer places\norder online"];
  "Task_3" [label="Hand over order to\nlogistics provider"];
  "Task_4" [label="Customer places\norder over the phone"];
  "Task_5" [label="Monitor shipment"];
  "Task_6" [label="Pick and pack items"];
  "Task_7" [label="Generate and send\norder confirmation"];
  "Task_8" [label="Process customer\nfeedback or returns"];
  "Task_9" [label="Generate shipping\nlabel"];
  "Task_10" [label="Send tracking\ninformation to\ncustomer"];
  "StartNoneEvent_1" [shape=circle, label="start"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];

  "ParallelGateway_1" -> "Task_9";
  "ExclusiveGateway_1" -> "Task_2";
  "Task_2" -> "ExclusiveGateway_2";
  "StartNoneEvent_1" -> "ExclusiveGateway_1";
  "Task_1" -> "ExclusiveGateway_3";
  "Task_10" -> "ExclusiveGateway_4";
  "ExclusiveGateway_2" -> "Task_7";
  "Task_4" -> "ExclusiveGateway_2";
  "Task_7" -> "ParallelGateway_1";
  "Task_8" -> "ExclusiveGateway_5";
  "ParallelGateway_1" -> "Task_6";
  "Task_5" -> "ExclusiveGateway_6";
  "Task_9" -> "ParallelGateway_2";
  "Task_6" -> "ParallelGateway_2";
  "ExclusiveGateway_1" -> "Task_4";
  "ExclusiveGateway_3" -> "Task_8";
  "ExclusiveGateway_6" -> "Task_1";
  "ExclusiveGateway_6" -> "ExclusiveGateway_4";
  "ExclusiveGateway_5" -> "EndNoneEvent_1";
  "ExclusiveGateway_3" -> "ExclusiveGateway_5";
  "ParallelGateway_2" -> "Task_3";
  "ExclusiveGateway_4" -> "Task_5";
  "Task_3" -> "Task_10";
}
