pmo-dataset/variations/mermaid_basic/06.mmd
graph LR
	ParallelGateway_1{"+"} --> Task_9["Generate shipping label"]
	ExclusiveGateway_1{"X"} --> Task_2["Customer places order online"]
	Task_2 --> ExclusiveGateway_2{"X"}
	StartEvent_1(("start")) --> ExclusiveGateway_1
	Task_1["Successful delivery"] --> ExclusiveGateway_3{"X"}
	Task_10["Send tracking information to customer"] --> ExclusiveGateway_4{"X"}
	ExclusiveGateway_2 --> Task_7["Generate and send order confirmation"]
	Task_4["Customer places order over the phone"] --> ExclusiveGateway_2
	Task_7 --> ParallelGateway_1
	Task_8["Process customer feedback or returns"] --> ExclusiveGateway_5{"X"}
	ParallelGateway_1 --> Task_6["Pick and pack items"]
	Task_5["Monitor shipment"] --> ExclusiveGateway_6{"X"}
	Task_9 --> ParallelGateway_2{"+"}
	Task_6 --> ParallelGateway_2
	ExclusiveGateway_1 --> Task_4
	ExclusiveGateway_3 --> Task_8
	ExclusiveGateway_6 --> Task_1
	ExclusiveGateway_6 --> ExclusiveGateway_4
	ExclusiveGateway_5 --> EndEvent_1(("end"))
	ExclusiveGateway_3 --> ExclusiveGateway_5
	ParallelGateway_2 --> Task_3["Hand over order to logistics provider"]
	ExclusiveGateway_4 --> Task_5
	Task_3 --> Task_10
